<a href="https://colab.research.google.com/github/Flaviaestat/Phyton/blob/master/00_Principais_Phyton.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### RESUMÃO PHYTON

Operadores Condicionais

In [0]:
x = 300

if x == 300:
  status = 'Na mosca!'
elif x>= 300:
  status = 'Maior!'
else:
  status = 'Menor :('

print('O valor é ' + status)

O valor é Na mosca!

Estrutura de loop básica

In [0]:
numeros = []
multiplo = 3

for i in range(0,10):
  resto = i%multiplo
  numeros.append( i * resto)


print('Mostra apenas os multiplos de ' + str(multiplo) + ' :')
print(numeros)
print('O último elemento é')
print(numeros[-1])
print('O primeiro elemento é')
print(numeros[0])
print('O segundo é')
print(numeros[1])

Mostra apenas os multiplos de 3 :
[0, 1, 4, 0, 4, 10, 0, 7, 16, 0]
O último elemento é
0
O primeiro elemento é
0
O segundo é
1

Input box

In [0]:
  age = input('Qual a sua idade?')

Qual a sua idade?20

Função

In [0]:
def idade(n):

  x = n * 2
  y = n / 2
  print('o dobro da sua idade é :' + str(x))
  print('a metade da sua idade é :' + str(y))

In [0]:
idade(20)

o dobro da sua idade é :40
a metade da sua idade é :10.0

In [0]:
def fizzBuzz(n):
    # Write your code here

    for i in range (1,n+1):

        if i%3 == 0 and i%5 == 0:
            print('FizzBuzz')
        elif i%3 == 0:
            print('Fizz')
        elif i%5 == 0:
            print('Buzz')
        else:
            print(i)

fizzBuzz(15)

1
2
Fizz
4
Buzz
Fizz
7
8
Fizz
Buzz
11
Fizz
13
14
FizzBuzz

Manipulação com arrays

In [0]:
dates = ['2018-01-01','2017-02-01', '2019-10-01']
evento = ['A','B','C']
valores = [200,300,400]
categoria = ['XL', 'XL','XS']

months = dates[5:1] #não consegui extrair uma posição no string do array - mais fácil no pandas
print(months)

[]

In [0]:
estados = ['GO', 'GO', 'SP', 'RJ']

estados_distintos = set(estados)

print(estados_distintos)

for index,element in enumerate(estados_distintos):
    lista = index,element

print(lista)

{'GO', 'SP', 'RJ'}
(2, 'RJ')

**Carregamento da base e visualização**

In [0]:
import numpy as np
import pandas as pd

#tranforma o array data em uma coluna no dataframe

datesDf = pd.DataFrame({'Data': dates, 'Evento': evento, 'Valores': valores, 'Categoria': categoria})

In [0]:
datesDf['Date'] = pd.to_datetime(datesDf['Data']) #padrão dateTime
datesDf['ano'] = datesDf['Date'].map(lambda x: x.strftime('%Y'))
#datesDf['Dia'] = datesDf['Date'].map(lambda x: x.strftime('%D'))

datesDf.head()

         Data Evento  Valores Categoria       Date   ano
0  2018-01-01      A      200        XL 2018-01-01  2018
1  2017-02-01      B      300        XL 2017-02-01  2017
2  2019-10-01      C      400        XS 2019-10-01  2019

In [0]:
#carrega base em csv

path = ''

baseDfCsv = pd.read_csv(path)

**Descrever features**

In [0]:
datesDf.describe()

              data
count            2
unique           2
top     2018-01-01
freq             1

Criando um contador (índice)

In [0]:
dataset_train['indice'] = list(range(len(dataset_train.index)))
dataset_train['indice'] = dataset_train['indice'] + 1

Contar distintos em um dataframe

In [0]:
print(len(dataset_train['Source'].unique()))

5

Contagem por var categorica

In [0]:
baseCount = datesDf.groupby("Categoria")["Categoria"].count() #tb funciona para sum

baseCount.head(5)

Categoria
XL    2
XS    1
Name: Categoria, dtype: int64

Agregação Outras funções

Agregação (médias, min, max) das variáveis numéricas por grupo

In [0]:
baseAgg = datesDf.groupby('Evento').agg({'Valores':['min','max','mean', 'first','last'], 'Categoria':['first']})

baseAgg.head(5)

       Valores                      Categoria
           min  max mean first last     first
Evento
A          200  200  200   200  200        XL
B          300  300  300   300  300        XL
C          400  400  400   400  400        XS

Seleciona Colunas

In [0]:
# select only required columns
baseReduzida = datesDf[["Valores", "Evento"]]

baseReduzida.head()

   Valores Evento
0      200      A
1      300      B
2      400      C

Cria nova coluna

In [0]:
datesDf['Valores10Perc'] = datesDf['Valores'] * 1.1 #metodo mais simples
datesDf['Valores20Perc'] = datesDf['Valores'].apply(lambda x: x * 1.2) #com apply

def doubleData(x):
   return x * 2

datesDf['ValoresDobro'] = datesDf['Valores'].apply(doubleData) #com apply e uma função

def Status(x):
  if x >= 300:
    return 'faixa1'
  else:
    return 'faixa0'

datesDf['Status'] = datesDf['Valores'].apply(Status) #com apply e uma função

datesDf.head(5)

         Data Evento  Valores  ... ValoresDobro exemploNull  Status
0  2018-01-01      A      200  ...          400         0.0  faixa0
1  2017-02-01      B      300  ...          600         0.0  faixa1
2  2019-10-01      C      400  ...          800         0.0  faixa1

[3 rows x 11 columns]

Tratamento NULLS

In [0]:
datesDf['exemploNull'] = np.nan # criando coluna de nulls para exemplo

datesDf.head(5)

         Data Evento  Valores  ... Valores20Perc ValoresDobro exemploNull
0  2018-01-01      A      200  ...         240.0          400         NaN
1  2017-02-01      B      300  ...         360.0          600         NaN
2  2019-10-01      C      400  ...         480.0          800         NaN

[3 rows x 10 columns]

Operating on Null Values
As we have seen, Pandas treats None and NaN as essentially interchangeable for indicating missing or null values. To facilitate this convention, there are several useful methods for detecting, removing, and replacing null values in Pandas data structures. They are:

isnull(): Generate a boolean mask indicating missing values
notnull(): Opposite of isnull()
dropna(): Return a filtered version of the data
 fillna(): Return a copy of the data with missing values filled or imputed

In [0]:
datesDf['exemploNull'] = datesDf['exemploNull'].fillna(0.0) #recodificando para 0

datesDf.head(5)

         Data Evento  Valores  ... Valores20Perc ValoresDobro exemploNull
0  2018-01-01      A      200  ...         240.0          400         0.0
1  2017-02-01      B      300  ...         360.0          600         0.0
2  2019-10-01      C      400  ...         480.0          800         0.0

[3 rows x 10 columns]

Filtrar

In [0]:

 #primeira forma
datesFilter = datesDf[datesDf['Status'] == 'faixa1']

Filtrar por lista

In [0]:
faixas = ['faixa1']#permite mais de um valor

datesFilter = datesDf[datesDf.Status.isin(faixas)]

datesFilter.head(5)

         Data Evento  Valores  ... ValoresDobro exemploNull  Status
1  2017-02-01      B      300  ...          600         0.0  faixa1
2  2019-10-01      C      400  ...          800         0.0  faixa1

[2 rows x 11 columns]

Filtrar com não contém

In [0]:
faixas = ['faixa1']#permite mais de um valor

datesFilter = datesDf[~datesDf.Status.isin(faixas)] # naõ contém 

datesFilter.head(5)

         Data Evento  Valores  ... ValoresDobro exemploNull  Status
0  2018-01-01      A      200  ...          400         0.0  faixa0

[1 rows x 11 columns]

Negação

Join

Histograma